[
  {
    "slug": "garden-genius",
    "title": "Garden Genius",
    "description": "Garden Genius is a React-based web app designed to help beginner gardeners manage and organize their plant care. Users can search for plants, save favorites, and access detailed information, with future plans to include note-taking and garden tracking features.",
    "noteText": "**This is an ongoing project. I'm actively adding new features and improving functionality. Stay tuned for updates!",
    "subText": "Sub text for this project meant for the project page",
    "isFeatured": true,
    "projectType": "detailed",
    "tags": ["React", "Design", "Branding", "UI/UX"],
    "thumbnail": "/gardengenius/main-home-4.jpg",
    "linkProjectPage": "projects/project-title",
    "githubURL": "https://github.com/jasin1/novi-eindopdracht-gardenGenius",
    "liveSiteURL": "https://garden-genius.netlify.app/",
    "role": "Frontend Developer",
    "date": "Juli 2024",
    "contentBlock": [
      {
        "type": "heading",
        "level": 2,
        "headingText": "The challenge"
      },
      {
        "type": "text",
        "content": "Many beginner gardeners find themselves overwhelmed by the vast amount of information available about plants and gardening. With countless resources and advice, it can be challenging to discern which plants are suitable for their specific location and current season. This complexity can lead to frustration and a lack of confidence in their gardening abilities. Additionally, the absence of a centralized platform for tracking personal experiences, plant care tips, and progress can hinder their growth and enjoyment in this new hobby."
      },

      {
        "type": "images",
        "content": [
          {
            "src": "/gardengenius/garden-1.jpg",
            "alt": "Image description"
          },
          {
            "src": "/gardengenius/garden-2.jpg",
            "alt": "Image description"
          }
        ]
      },
      {
        "type": "heading",
        "level": 2,
        "headingText": "The Solution I Built"
      },

      {
        "type": "text",
        "content": "To address these challenges, I built Garden Genius, a React-based web app that simplifies the gardening experience by allowing users to search for and save their favorite plants. The app integrates with a plant API, providing essential information like plant care, growth conditions, and images. Users can easily 'like' and save plants for future reference, creating their own personalized plant library. While it's an MVP, Garden Genius already streamlines plant care management, making gardening more approachable and fun for beginners."
      },
      {
        "type": "images",
        "content": [
          {
            "src": "/gardengenius/home-search.jpg",
            "alt": "Image description"
          }
        ]
      },
      {
        "type": "images",
        "content": [
          {
            "src": "/gardengenius/plant-detail.jpg",
            "alt": "Image description"
          }
        ]
      },
      {
        "type": "images",
        "content": [
          {
            "src": "/gardengenius/saved-plants.jpg",
            "alt": "Image description"
          }
        ]
      },
      {
        "type": "heading",
        "level": 2,
        "headingText": "The Journey"
      },
      {
        "type": "text",
        "content": "Building Garden Genius was both a technical and creative challenge. I started by planning the app’s architecture and user flow, ensuring it was simple enough for beginners while scalable for future features. I implemented React hooks like useState for managing dynamic data, useEffect to handle API calls for plant search functionality, and useContext to efficiently pass data across components, such as user-authentication status and saved plants. One of the more complex parts was developing the login and sign-up functionality, which included form validation and user state management. Ensuring data persisted across sessions while maintaining a smooth user experience was essential. Overcoming these technical challenges shaped the app into a responsive and user-friendly tool."
      },
      {
        "type": "images",
        "content": [
          {
            "src": "/gardengenius/figma-screenshot.jpg",
            "alt": "Image description"
          },
          {
            "src": "/gardengenius/code-base-2.jpg",
            "alt": "Image description"
          }
        ]
      },
      {
        "type": "text",
        "content": "In addition to the technical development, I created a cohesive visual style and logo for Garden Genius. While not a core requirement, the branding helped unify the app’s design and enhance the user experience. Though not the primary focus, it was important for me to complete the project with attention to both form and function."
      },
      {
        "type": "heading",
        "level": 2,
        "headingText": "Current Features & Future Growth"
      },
      {
        "type": "text",
        "content": "Currently, Garden Genius offers a simple yet effective solution to organize plant information. Users can search for plants by name, explore details like growth requirements, and save plants to a personal list. Future updates will expand functionality, including a note-taking feature where users can track plant progress and care tasks. Additionally, I'm planning to introduce a calendar for scheduling gardening activities, notifications for plant care, and even integration with smart gardening devices. As the app grows, Garden Genius aims to become a complete gardening assistant, helping users cultivate beautiful, thriving gardens with ease."
      }
    ],
    
    "buttons": [
      {
        "text": "Github Repo",
        "href": "https://github.com/jasin1/novi-eindopdracht-gardenGenius",
        "linkType": "external",
        "variant": "white",
        "hasArrow": true
      }
    ]
  },

  {
    "slug": "budlr-project",
    "title": "Budlr",
    "description": "Implemented Budlr's web design in Webflow, translating their vision into a seamless online experience. Contributed to the design process to ensure consistency and clarity, supporting their mission to reduce financial stress through innovative digital tools.",
    "subText": "Sub text for this project meant for the project page",
    "isFeatured": false,
    "projectType": "normal",
    "tags": ["Webflow"],
    "thumbnail": "/budlr/homepage.jpg",
    "linkProjectPage": "projects/project-title",
    "githubURL": "",
    "liveSiteURL": "https://www.budlr.nl/",
    "role": "Frontend Developer",
    "date": "Juli 2024",
    "contentBlock": [

      {
        "type": "heading",
        "level": 2,
        "headingText": "About Budlr"
      },
      {
        "type": "text",
        "content": "Budlr is a social enterprise founded in 2018 to tackle financial stress and vulnerability through technology and innovative services. With a mission to help employees and households gain control over their finances, Budlr focuses on improving financial well-being by offering digital tools and advisory services to reduce stress, enhance productivity, and prevent debt-related issues."
      },
      {
        "type": "images",
        "content": [
          {
            "src": "/budlr/screen-2.jpg",
            "alt": "Image description"
          }
        ]
      },
      {
        "type": "heading",
        "level": 2,
        "headingText": "My Contribution"
      },
      {
        "type": "text",
        "content": "For this project, I was responsible for implementing Budlr’s web design in Webflow, translating their vision into a seamless online experience. While I followed their design guidelines closely, my background as a designer allowed me to contribute significantly by ensuring the visual elements were applied effectively and consistently. By combining my technical skills with a keen design sense, I played an active role in ensuring that the digital execution reflected Budlr’s brand identity and met their functional needs."
      },
      {
        "type": "images",
        "content": [
          {
            "src": "/budlr/screen-5.jpg",
            "alt": "Image description"
          }
        ]
      }
    ],
    "buttons": [
      {
        "text": "Live Site",
        "href": "https://budlr.nl",
        "linkType": "external",
        "variant": "white",
        "hasArrow": true
      }
    ]
  },

  {
    "slug": "bikeshop-west",
    "title": "Bikeshop West",
    "description": "Designed and developed a custom website in Webflow, including a dynamic bike rental page powered by JavaScript, offering seamless booking and rental management.",
    "subText": "Sub text for this project meant for the project page",
    "isFeatured": false,
    "projectType": "normal",
    "tags": ["Webflow", "Javascript", "Design"],
    "thumbnail": "/bikeshop/homepage.jpg",
    "linkProjectPage": "projects/project-title",
    "githubURL": "",
    "liveSiteURL": "https://www.bikeshopwest.nl/",
    "role": "Frontend Developer",
    "date": "Juli 2024",
    "contentBlock": [
      
      {
        "type": "heading",
        "level": 2,
        "headingText": "My contribution"
      },
      {
        "type": "text",
        "content": "BikeShop West provides bike repair, maintenance, rentals, and accessories for urban cyclists in Amsterdam. I designed and developed their website in Webflow, focusing on clean, user-friendly navigation to showcase their services. I also built a custom rental page using vanilla JavaScript, where users can easily select bike types, rental durations, pick-up dates, and accessories. The system sends confirmation emails to both the customer and the shop, streamlining the rental process for the business. This project highlights my ability to integrate user experience with functional design, ensuring the website supports both service presentation and rental management."
      },
      {
        "type": "images",
        "content": [
          {
            "src": "/bikeshop/rad.jpg",
            "alt": "Image description"
          },
         
          {
            "src": "/bikeshop/rental-1.jpg",
            "alt": "Image description"
          }
        ]
      }
    ],
    "buttons": [
      {
        "text": "Live Site",
        "href": "https://www.bikeshopwest.nl/",
        "linkType": "external",
        "variant": "white",
        "hasArrow": true
      }
    ]
  },

  {
    "slug": "mijn-kinderopvang",
    "title": "Mijn kinderopvang",
    "description": "Designed and built the website in Webflow, with a JavaScript-based pricing calculator for flexible child care services, helping parents find the perfect care package for their children.",
    "subText": "Sub text for this project meant for the project page",
    "isFeatured": false,
    "projectType": "normal",
    "tags": ["Webflow", "Javascript", "Design"],
    "thumbnail": "/opvang/homepage.jpg",
    "linkProjectPage": "projects/project-title",
    "githubURL": "",
    "liveSiteURL": "https://www.mijn-kinderopvang.nl/",
    "role": "Frontend Developer",
    "date": "Juli 2024",
    "contentBlock": [
      {
        "type": "heading",
        "level": 2,
        "headingText": "The Project"
      },
      {
        "type": "text",
        "content": " 'Mijn Kinderopvang' offers personalized, flexible child care across six locations in Almere, creating a safe, welcoming environment for children. I designed and built their website in Webflow, ensuring the brand's approachable and caring identity was reflected in every aspect of the user experience. I also developed a JavaScript-based pricing calculator that allows parents to select their desired child care options, including after-school and full-day care, and customize the package based on days and times. The calculator automatically generates pricing and emails the selected options to both the parent and the company, streamlining communication and simplifying the service selection process."
      },
      {
        "type": "images",
        "content": [
          {
            "src": "/opvang/rekentool.jpg",
            "alt": "Image description"
          },
          {
            "src": "/opvang/section.jpg",
            "alt": "Image description"
          }
        ]
      }
    ],
    "buttons": [
      {
        "text": "Live Site",
        "href": "https://www.mijn-kinderopvang.nl/",
        "linkType": "external",
        "variant": "white",
        "hasArrow": true
      }
    ]
  }
]
